{
  "salute": "Hey there,",
  "intro_1": "JM Molina",
  "intro_1_2": "Senior Software Engineer",
  "about": "As a software engineer with a strong focus on front-end web development, I specialize in creating accessible, intuitive, and responsive user interfaces, blending clean, modern design with cutting-edge technologies.\n\nMy experience spans the full stack, but my passion for design has led me to excel in front-end performance optimization, improving user experience by ensuring fast load times and seamless interactions. With a meticulous eye for detail, I strive to deliver projects that are not only highly functional but beautifully crafted. \n\nOutside of work, I enjoy spending time with my girlfriend and our playful Pomeranian, Balú.\n",
  "side_project": "Check out my last side project:",
  "icims_desc": "During my time with the Video Studio team, I was responsible for both maintaining and developing new features for the product. Our primary tech stack consisted of Vue and Angular, though I also contributed to React projects, including building a custom Video Player web component from scratch using Preact. \n\n One of the first projects I took full control of was leading the development of a Chrome extension, designed from the ground up using Vue. The extension enabled cross-team collaboration and enhanced access to product features, providing significant improvements for users. \n\n In addition to my development role, I served as Scrum Master for a year, where I facilitated Agile ceremonies such as sprint planning, grooming sessions, daily stand-ups, sprint reviews, and retrospectives plus collaborating closely with the product manager, assisting with ticket management and creating metrics to measure and improve team maturity. \n\n I also participated in our team’s “office hours” initiative, where we set aside 2 hours and 30 minutes every Tuesday and Thursday to help anyone who needed assistance. This was a great way to foster collaboration, answer questions, and help others learn more about the Video Studio app.",
  "z1_desc": "I had the opportunity to work in a really great environment, surrounded by passionate individuals who genuinely enjoyed what they were doing. Everyone was highly detail-oriented, and the focus on design was always front and center, especially since many of our clients were the ones defining the app’s functionality. <br/><br/> It was also an incredible learning experience for me, as it was my first time working with up-to-date frameworks like Angular, Vue, React, and Next. Furthermore, every client I collaborated with was an English speaker or from overseas, which made the work even more interesting and broadened my perspective. <br/><br/> Some notable projects I worked on while on Z1 were for <a href=\"https://www.sendtrumpet.com/\" target=\"_blank\" rel=\"noopener noreferrer\">Trumpet</a>, <a href=\"https://www.smartvault.com\" target=\"_blank\" rel=\"noopener noreferrer\">Smartvault</a> client portal and API documentation, <a href=\"https://www.localist.com/\" target=\"_blank\" rel=\"noopener noreferrer\">Localist</a> theming system revamp using liquid, <a href=\"https://logistimatics.com/\" target=\"_blank\" rel=\"noopener noreferrer\">Logistimatics</a> website and store, <a href=\"https://www.biograph.com/\" target=\"_blank\" rel=\"noopener noreferrer\">Biograph</a> user portal and <a href=\"https://www.alloy.com/\" target=\"_blank\" rel=\"noopener noreferrer\">Alloy</a> identity verification process between others. <br/><br/>During my time on Z1 I spent a decent amount of time co-managing the front-end development team, mentored junior developers, and handled performance evaluations and reviews while also doing my coding duties.",
  "babel_desc": "Internal applications team. Responsible for development, maintenance and support of applications used by company staff. Was a great first job experience and the working environment was remarkable. \n\n <strong>Integral Maintenance of Endesa Ingeniería's Information Systems.</strong> \n\n - The project consisted of the integral maintenance of Endesa Ingeniería's information systems, including corrective, improvement and evolutionary maintenance of corporate and business applications, as well as maintenance of the systems infrastructure, communications and user support. \n - Likewise, the geographical scope of the service is global, including all Endesa Ingeniería offices and facilities (currently in Seville, Madrid, Barcelona and Las Palmas de Gran Canaria). \n\n <strong>Remote Development Center - Client: Andalucía Emprende</strong> \n\n - Design and construction of the digital platform of the Andalusian system for entrepreneurship. \n - CDR: High performance team in charge of the software development projects that are done from BABEL's office: closed projects, managed developments, maintenance and warranties, etc. \n - Working with the main technologies (Java, .NET, PHP, Angular, content management systems, Ensemble, etc.) and all managed by an SGS with ISO 2000 and CMMi DEV3 certifications and implementing the best technological practices. \n\n <strong>Internal Applications Team</strong> \n\n - Leading development, support and maintenance of the “Commercial Tracking” application, used by the administrative staff, managers and directors of the company. \n - Support and development of the company's specific Intranet. - Support and development of the company's specific social network.",
  "internship_desc": "Got the opportunity to start working as an intern on 2016 when I wasn't even done with my college degree and been happily coding since then. \n\n - In charge of development, support and maintenance of the “Commercial Tracking” application, used by the company's administrative staff. \n - Support and development of the company's specific Intranet. \n - Support and development of the company's specific Intranet",
  "Remote (Holmdel, New Jersey, United States)": "Remote (Holmdel, New Jersey, United States)",
  "Hybrid (Seville)": "Hybrid (Seville)",
  "Seville": "Seville",
  "Mar 2016 - Aug 2019": "Mar 2016 - Aug 2019",
  "Aug 2016 - Jan 2019": "Aug 2016 - Jan 2019",
  "Jan 2019 - Feb 2022": "Jan 2019 - Feb 2022",
  "Feb 2022 - Oct 2024": "Feb 2022 - Oct 2024",
  "Browser extensions": "Browser extensions (Manifest V3)",
  "Babel (Internship)": "Babel (Internship)",
  "iCIMS": "iCIMS",
  "Z1 Digital Studio": "Z1 Digital Studio",
  "Babel": "Babel",
  "locale_switch": "Switch to spanish",
  "switch_theme": "Switch theme to {theme}",
  "light": "light",
  "dark": "dark",
  "sepia": "sepia",
  "send_email": "Get in touch"
}
