{
  "salute": "Hola,",
  "intro_1": "JM Molina",
  "intro_1_2": "Ingeniero de software senior",
  "about": "Moviendo píxeles desde 2016.\n\nComo ingeniero de software especializado en desarrollo web front-end, creo interfaces de usuario accesibles, intuitivas y adaptativas que combinan un diseño limpio y moderno con tecnologías de vanguardia.\n\nMi gran interés en trabajar con plataformas globales me permite aplicar mis habilidades a proyectos que alcanzan una audiencia diversa y mundial.\n\nAunque mi experiencia abarca todo el stack, mi pasión por el diseño me impulsa a destacar en la optimización del rendimiento front-end, mejorando la experiencia del usuario a través de tiempos de carga rápidos y interacciones fluidas. Con un ojo meticuloso para los detalles, me esfuerzo por entregar proyectos que no solo sean altamente funcionales, sino también bonitos visualmente.\n\nFuera del trabajo, disfruto pasando el tiempo con mi novia y nuestro juguetón pomerania, Balú.",
  "icims_desc": "Durante mi tiempo con el equipo de Video Studio, fui responsable tanto de mantener como de desarrollar nuevas características para el producto. Nuestro stack tecnológico principal consistía en Vue y Angular, aunque también contribuí a proyectos con React siempre que tuve oportunidad. \n\n Lideré varios proyectos clave que implicaron el desarrollo de soluciones personalizadas para optimizar los flujos de trabajo y mejorar la experiencia del usuario. Al crear herramientas desde cero, pude facilitar la colaboración entre equipos y simplificar procesos complejos, lo que permitió que las características de nuestros productos fueran más accesibles y adaptables. Mi enfoque a menudo incluía la reducción de deuda técnica al eliminar dependencias obsoletas y consolidar componentes para hacerlos más fáciles de mantener. Utilizando tecnologías como Vue, Preact y TypeScript, creé componentes reutilizables y envoltorios eficientes que gestionaban automáticamente los atributos principales, lo que impulsó tanto la eficiencia en el desarrollo como la escalabilidad del producto. \n\n Estos esfuerzos tuvieron un impacto significativo en la mejora de los flujos de trabajo del equipo y en hacer nuestras soluciones más flexibles y fáciles de usar en diversos productos (por ejemplo, una extensión de Chrome que facilitó la colaboración entre equipos y mejoró el acceso a las características del producto, brindando mejoras significativas para los usuarios y visibilidad para el producto, y nuestro propio componente web de reproductor de video que nos permitió pasar de tres a un solo reproductor, eliminar dependencias obsoletas y, en general, simplificar nuestro flujo de trabajo y agilizar todo el proceso de desarrollo). \n\n Además de mi rol de desarrollo, también serví como Scrum Master durante un año, donde facilité ceremonias ágiles como la planificación de sprints, sesiones de grooming, daily stand-ups, revisiones de sprints y retrospectivas, además de colaborar estrechamente con el product manager, ayudando en la gestión de tickets y creando métricas para medir y mejorar la madurez del equipo. \n\n También participé en la iniciativa de \"horas de oficina\" de nuestro equipo, donde reservamos 2 horas y 30 minutos cada martes y jueves para ayudar a cualquier persona que necesitara asistencia. Esta fue una excelente manera de fomentar la colaboración, responder preguntas y ayudar a otros a aprender más sobre la aplicación Video Studio.",
  "z1_desc": "Tuve la oportunidad de trabajar en un entorno realmente genial, rodeado de personas apasionadas que realmente disfrutaban lo que hacían. Todos eran muy detallistas y el enfoque en el diseño siempre fue una prioridad, especialmente porque muchos de nuestros clientes eran quienes definían la funcionalidad de la aplicación. <br/><br/> También fue una experiencia de aprendizaje increíble para mí, ya que fue la primera vez que trabajé con frameworks actualizados como Angular, Vue, React y Next. Además, todos los clientes con los que colaboré hablaban inglés o eran del extranjero, lo que hizo que el trabajo fuera aún más interesante y amplió mi perspectiva. <br/><br/> Algunos de los proyectos más destacados en los que trabajé en Z1 fueron para <a href=\"https://www.sendtrumpet.com/\" target=\"_blank\" rel=\"noopener noreferrer\">Trumpet</a>, para el portal de clientes y la documentación de la API de <a href=\"https://www.smartvault.com\" target=\"_blank\" rel=\"noopener noreferrer\">Smartvault</a>, la renovación del sistema de temas de <a href=\"https://www.localist.com/\" target=\"_blank\" rel=\"noopener noreferrer\">Localist</a> utilizando liquid, la tienda y el sitio web de <a href=\"https://logistimatics.com/\" target=\"_blank\" rel=\"noopener noreferrer\">Logistimatics</a>, el portal de usuarios de <a href=\"https://www.biograph.com/\" target=\"_blank\" rel=\"noopener noreferrer\">Biograph</a> y el proceso de verificación de identidad de <a href=\"https://www.alloy.com/\" target=\"_blank\" rel=\"noopener noreferrer\">Alloy</a>, entre otros. <br/><br/> Durante mi tiempo en Z1, dediqué una cantidad considerable de tiempo a co-gestionar el equipo de desarrollo front-end, mentoricé a desarrolladores junior y me encargué de las evaluaciones de desempeño y revisiones, además de cumplir con mis deberes de programación.",
  "babel_desc": "Equipo de aplicaciones internas. Responsable del desarrollo, mantenimiento y soporte de aplicaciones utilizadas por el personal de la empresa. Fue una excelente primera experiencia laboral y el ambiente de trabajo fue notable. \n\n <strong>Mantenimiento Integral de los Sistemas de Información de Endesa Ingeniería</strong> \n\n - El proyecto consiste en el mantenimiento integral de los sistemas de información de Endesa Ingeniería, incluyendo tanto el mantenimiento correctivo, perfectivo y evolutivo de las aplicaciones corporativas y de negocio, como el mantenimiento de la infraestructura de sistemas, las comunicaciones y el soporte a usuarios.\n - Asimismo, el ámbito geográfico de prestación del servicio es global, comprendiendo todas las oficinas e instalaciones de Endesa Ingeniería (actualmente en Sevilla, Madrid, Barcelona y Las Palmas de Gran Canaria). \n\n <strong>Centro de Desarrollos Remotos - Cliente: Andalucía Emprende</strong> \n\n - Diseño y construcción de la plataforma digital del sistema andaluz para emprender \n - CDR: Equipo de alto rendimiento encargado de los proyectos de desarrollo de software que se hacen desde la oficina de BABEL, sean proyectos cerrados, desarrollos gestionados, mantenimientos y garantías, etc. \n - Trabajando con las principales tecnologías (Java, .NET, PHP, Angular, gestores de contenidos, Ensemble, etc) y todo gestionado mediante un SGS con las certificaciones ISO 2000 y CMMi DEV3, e implementando las mejores prácticas tecnológicas. \n\n <strong>Equipo de Aplicaciones Internas</strong> \n\n - Responsable de evolutivos, soporte y mantenimiento de la aplicación de \"Seguimiento Comercial\", empleada por el personal administrativo, gerentes y directores de la empresa. \n - Soporte y desarrollo de la Intranet específica de la empresa. \n - Soporte y desarrollo de la red social específica de la empresa. \n - Support and development of the company's specific social network.",
  "internship_desc": "Tuve la oportunidad de empezar a trabajar como becario en 2016, cuando ni siquiera había terminado la carrera, y desde entonces no he parado de programar. \n\n - Encargado de evolutivos, soporte y mantenimiento de la aplicación de \"Seguimiento Comercial\", empleada por el personal administrativo de la empresa. \n - Soporte y desarrollo de la Intranet específica de la empresa. \n - Soporte y desarrollo de la red social específica de la empresa.",
  "Remote (Holmdel, New Jersey, United States)": "Remoto (Holmdel, New Jersey, Estados Unidos)",
  "Hybrid (Seville)": "Híbrido (Sevilla)",
  "Seville": "Sevilla",
  "Mar 2016 - Aug 2019": "Mar 2016 - Ago 2019",
  "Aug 2016 - Jan 2019": "Ago 2016 - Ene 2019",
  "Jan 2019 - Feb 2022": "Ene 2019 - Feb 2022",
  "Feb 2022 - Oct 2024": "Feb 2022 - Oct 2024",
  "Browser extensions": "Extensiones de navegador (Manifest V3)",
  "Babel (Internship)": "Babel (Becario)",
  "iCIMS": "iCIMS",
  "Z1 Digital Studio": "Z1 Digital Studio",
  "Babel": "Babel",
  "locale_switch": "Cambiar a inglés",
  "switch_theme": "Cambiar tema a {theme}",
  "light": "claro",
  "dark": "oscuro",
  "sepia": "sepia",
  "send_email": "Ponte en contacto conmigo",
  "recommendation_letters": "Cartas de recomendación"
}
